
console.log("-----------------Tasks1-3-----------------")
//-        Создать объект car, добавить к нему свойство color со значением 'черный'
//
// -        Изменить свойство color объекта car на 'зеленый'
//
// -        В объект car добавить свойство power, которое является функцией и выводит в консоль мощность двигателя
let Car = {
    color: 'Чёрный', 
    power: function Strenght() {
        console.log('500Вт')
    }
};
Car.color = 'Зелёный';
console.log(Car.color);
Car.power();

console.log("-----------------Tasks4-----------------")
// -На склад принимают груши и яблоки, напишите функцию, которая возвращает результат сложения количества принятых груш и яблок
function Storage(apple, pears) {
    console.log("Количество принятых груш и яблок- " + (apple + pears));
}
Storage(5,6);

console.log("-----------------Tasks5-----------------")
// -В терминале оплаты сохранено ваше имя, напишите функцию для определения имени в терминале(если вы ввели ваше имя, то привет + имя, если нет, то нет такого имени)
function Bank() {
    let userName = 'Alexei';
    if (userName === 'Alexei'){
        console.log("Привет" + userName);
    }
    else{
        console.log("Нет такого имени!");
    }
}
Bank();

console.log("-----------------Tasks6-7-----------------")
//
// - Напишите функцию вычисления типа аргумента и вывод типа в консоль
//
// - Напишите функцию, которая определяет является ли число простым или нет
function TypeOf() {
    let number = 111;
    console.log(typeof(number));
}
TypeOf();
//Это пример в котором описано простое число 73 , но не все остальные!
//Простое число - это число делящееся на само себя и на единицу без остатка!
function SimpleNumber() {
    let number = 73;
    if (number / 73 && number / 1){
        console.log("Простое число- " + number);
    }
    else {
        console.log("Составное число")
    }
}
SimpleNumber();

